Repository: cyrilvincent/arcade
Catalog: amstrad/Usifac/Amstrad CPC serial interface/Cpcload/locale/poedit/*/cpcload.po
Languages: de

source: DSK Output Folder
de: DSK Zielordner

source: Joystick on numeric keypad (NumLock off)
de: Joystick auf Nummernblock (NumLock aus)

source: Customize Fields
de: Felder anpassen

source: Available fields:
de: Verfügbare Felder:

source: A&dd
de: &Hinzufügen

source: &Remove
de: &Entfernen

source: Add A&ll
de: &Alle hinzufügen

source: Remo&ve All
de: Alle ent&fernen

source: Defaul&t
de: &Standard

source: Selection:
de: Auswahl:

source: &File
de: &Datei

source: &Open...
de: Ö&ffnen

source: Drive A
de: Laufwerk A

source: &Properties...
de: &Eigenschaften...

source: &Print...
de: Dr&ucken

source: Print Pre&view
de: Druck&vorschau

source: Print &Setup...
de: Druckeinstellun&g

source: &Edit
de: &Bearbeiten

source: &Copy
de: &Kopieren

source: &Cut
de: A&usschneiden

source: &Paste
de: E&infügen

source: &View
de: Ansich&t

source: &Fullscreen
de: &Ganzer Bildschirm

source: &Toolbar
de: Symbolleis&te

source: &Statusbar
de: &Statusleiste

source: &Large icons
de: &Große Bilder

source: &Help
de: &Hilfe

source: &Go to the %s Web Site
de: &Gehe zur %s Website

source: &Check for updates...
de: Nach &Updates suchen

source: Check for updates on the %s website
de: Nach Updates auf der %s Website suchen

source: Change&log
de: Versi&onshistorie

source: &About...
de: Ü&ber...

source: Drive &A:
de: Laufwerk &A:

source: Drive &B:
de: Laufwerk &B:

source: Program
de: Programm

source: Tool
de: Werkzeug

source: &Run...
de: &Starte...

source: Load and run disk
de: Lade und starte Disk

source: Open &Disk
de: Öffne &Disk

source: Load disk
de: Lade Disk

source: Open Memory &Snapshot
de: Öffne &Speicherabbild

source: Load memory snapshot
de: Lade Speicherabbild

source: T&ree
de: &Verzeichnisstruktur

source: &Images
de: &Bilder

source: Scr&eenshot
de: Scr&eenshots

source: Reset la&yout
de: La&yout zurücksetzen

source: Default positioning of toolbars
de: Werkzeug Standardpositionen

source: &Large Icons
de: Gr&oße Bilder

source: S&mall Icons
de: K&leine Bilder

source: Lis&t
de: Lis&te

source: &Tools
de: &Werkzeuge

source: &Options...
de: O&ptionen

source: About
de: Über...

source: Cl&ose
de: Sch&liessen

source: Settings
de: Einstellungen

source: Enable
de: Aktivieren

source: Path
de: Pfad

source: Fullscreen
de: Ganzer Bildschirm

source: Resolution
de: Auflösung

source: Model
de: Modell

source: Keyboard
de: Tastatur

source: Text mode
de: Text Modus

source: 40x25 (default)
de: 40x25 (standard)

source: Color scheme
de: Farbschema

source: Default
de: Standard

source: Print Screen key
de: Druck Taste

source: Folder:
de: Verzeichnis:

source: &Screenshot folder
de: S&creenshot Verzeichnis

source: &Maps folder
de: &Kartenverzeichnis

source: &Memory snapshot folder
de: Speichera&bbildverzeichnis

source: S&kin
de: Benut&zeroberfläche

source: Advanced
de: Fortgeschritten

source: &Options
de: Op&tionen

source: Split screenshots
de: Teile Screenshots auf

source: Show tooltips
de: Zeige Werkzeughilfen an

source: Put title on clipboard
de: Setze Titel in Zwischenablage

source: &Confirmation
de: Bestäti&gung

source: Show pick dialog
de: Zeige Auswahldialog

source: Show exit dialog
de: Zeige Beendendialog

source: Test screenshot
de: Teste Screenshot

source: Input files:
de: Eingangsdateien:

source: Output file:
de: Zieldatei:

source: Input file:
de: Eingangsdatei:

source: Output folder:
de: Zielverzeichnis:

source: Input folder:
de: Eingangsverzeichnis:

source: Location:
de: Ort:

source: Record range:
de: Aufzeichnungsbereich:

source: Merge
de: Verbinde

source: Sort &Ascending
de: Sortiere &Aufsteigend

source: Sort &Descending
de: Sortiere A&bsteigend

source: Sort
de: Sortiere

source: Customize Fields...
de: Felder einrichten...

source: &Copy Row
de: Kopiere &Reihe

source: Cop&y Cell
de: Kopiere &Zelle

source: &Map...
de: &Karte...

source: &Properties
de: Ei&genschaften

source: Zoom &In
de: Verg&rößern

source: Zoom &Out
de: Ver&kleinern

source: Actual size
de: Aktuelle Größe

source: Map
de: Karte

source: Show only games with maps
de: Zeige nur Spiele mit Karte

source: Screen Snapshot
de: Bildschirmfoto

source: Show only games with screenshots
de: Zeige nur Spiele mit Bildschirmfotos

source: Show only games with web links
de: Zeige nur Spiele mit Weblinks

source: Memory Snapshot
de: Speicherabbild

source: Show only games with memory snapshots
de: Zeige nur Spiele mit Speicherabbildern

source: &More...
de: &Mehr...

source: Run
de: Start

source: Executable files
de: Ausführbare Dateien

source: Startup command
de: Startup Befehl

source: To run "%s", type this in the emulator window: |or
de: Um "%s" zu starten, geben sie |or in das Emulatorfenster ein

source: More
de: Mehr

source: Screenshot
de: Bildschirmfoto

source: Always show this dialog
de: Zeige immer diesen Dialog

source: Do you want to save changes to %s?
de: Wollen sie die Änderungen nach %s speichern?

source: Search
de: Suche

source: Please type text
de: Bitte geben sie Text ein

source: Please enter at least %d characters
de: Bitte geben sie mindestens %d Zeichen ein

source: Please enter no more than %d characters
de: Bitte geben sie nicht mehr als %d Zeichen ein

source: ERROR: %s requires a more recent version of %s Installed version %d.%02d, required version %d.%02d
de: FEHLER: %s benötigt eine neuere Version von %s Installierte Version %d.%02d, benötigte Version %d.%02d

source: Please enter a number between %g and %g
de: Bitte geben sie eine Nummer zwischen %g und %g ein

source: Please enter a number greater than %g
de: Bitte geben sie eine Zahl größer als %g ein

source: Please enter a number less than %g
de: Bitte geben sie eine Zahl kleiner als %g ein

source: Maximum length is %d
de: Maximale Länge ist %d

source: {about}Acknowledgements
de: {about}Danksagungen

source: {about}License agreement
de: {about}Lizenzabkommen

source: Network Computers
de: Netzwerk Computer

source: %s: Not implemented
de: %s: Nicht Impelementiert

source: True
de: Wahr

source: False
de: Falsch

source: Yesterday|Today|Tomorrow
de: Gestern|Heute|Morgen

source: &Minimize
de: &Minimieren

source: &Sort by name
de: &Nach Namen sortieren

source: &Sort by type
de: &Nach Typ sortieren

source: &Sort by date
de: &Nach Datum sortieren

source: &Sort by size
de: &Nach Größe sortieren

source: &List mode
de: &Listenmodus

source: &Details mode
de: &Detailmodus

source: &Large icons mode
de: &Große Bildermodus

source: &Small icons mode
de: &Kleiner Bildermodus

source: &Setup...
de: &Einstellungen...

source: &Goto...
de: &Gehe zu...

source: &Run
de: &Start

source: {filter}%s Files
de: {filter}%s Dateien

source: {filter}All Files
de: {filter}Alle Dateien

source: {filter}Image Files
de: {filter}Image Dateien

source: &Always show this dialog
de: Zeige immer diesen &Dialog

source: Percent
de: Prozent

source: Ready
de: Bereit

source: &Font
de: &Schriftart

source: &Color
de: &Farbe

source: {document}untitled
de: {document}unbenannt

source: {confirm}Close %s now?
de: {confirm} %s jetzt schliessen ?

source: Select a file
de: Datei auswählen

source: Select a directory
de: Verzeichnis auswählen

source: Choose colour
de: Farbe auswählen

source: Choose font
de: Schriftart auswählen

source: Input Text
de: Text eingeben

source: Launching %s
de: Starte %s

source: {softwareupdate}Platform|Version|Release|Date||Download
de: {softwareupdate}Platform|Version|Release|Datum||Download

source: Newer|Older|Same
de: Neuer|Älter|Gleich

source: Failed
de: Fehlgeschlagen

source: Bad path: %s
de: Ungültiger Pfad: %s

source: Bad file format
de: Ungültiges Dateiformat

source: File not found
de: Datei nicht gefunden

source: %s requires a more recent version of %s Installed version %d.%02d, required version %d.%02d
de: %s benötigt eine neuere Version von %s Installierte Version %d.%02d, benötigte Version %d.%02d

source: '%s' is invalid
de: '%s' ist ungültig

source: '%s' should only contain ASCII characters.
de: '%s' sollte nur ASCII Zeichen enthalten.

source: '%s' should only contain alphabetic characters.
de: '%s' sollte nur Alphabetische Zeichen enthalten.

source: '%s' should only contain alphabetic or numeric characters.
de: '%s' sollte nur Alphabetische Zeichen oder Zahlen enthalten.

source: '%s' should be numeric.
de: '%s' sollte numerisch sein.

source: Validation conflict
de: Überprüfungskonflikt

source: Please choose language:
de: Bitte Sprache wählen:

source: Unknown
de: Unbekannt

source: Elapsed time:
de: Vergangene Zeit:

source: Estimated time:
de: Geschätzte Zeit:

source: Remaining time:
de: Verbleibende Zeit:

source: unknown
de: unbekannt

source: Done.
de: Fertig.

source: Open &Snapshot
de: Öffne &Abbild

source: {Filter}Map
de: {Filter}Karte

source: Tree
de: Verzeichnisstuktir

source: All games
de: Alle Spiele

source: Yes|No
de: Ja|Nein

source: Options
de: Optionen

source: {profile}None|File|Registry
de: {profile}Keine|Datei|Registrierung

source: {fmt}Name|Dimension|Modified|Size|Palette|Mask|Alpha channel|Tags|Type
de: {fmt}Name|Dimension|Bearbeitet|Größe|Palette|Maske|Alphakanal|Tags|Typ

source: {image}%d colors
de: {image}%d Farben

source: {uploaded}%s by %s
de: {uploaded}%s von %s

source: {emu}Internal %s
de: {emu}(Intern) %s

source: Exit to %s ?
de: Verlassen und zu %s wechseln?

source: {col}Title|Company|Year|Language|Type|Subtype|Size|Disks|Files|Title screen|Cheat mode|Protected|CPC Loader format|Problems|Created|Uploaded|Upload date|Upload name|Comments|Short name|Screenshot|Snapshot|Map|Run|Emulator|Weblink|System disk|Author
de: {col}Titel|Firma|Jahr|Sprache|Typ|Untertyp|Größe|Disks|Dateien|Titelbildschirm|Cheatmodus|Geschützt|CPC Loaderformat|Probleme|Erstellt|Uploaded|Uploaddatum|Uploadname|Kommentare|Kurzname|Screenshot|Snapshot|Karte|Run|Emulator|Weblink|Systemdisk|Author

source: {col}Title|Author|Description|Copyright|Comment|Creation Time|Software|File|File time|Format|Size
de: {col}Title|Autor|Beschreibung|Copyright|Kommentar|Erstellungszeit|Software|Datei|Dateizeit|Format|Größe

source: {skin}On|Off|Browse...
de: {skin}An|Aus|Blättern...

source: {res}Low|High|Higher|Console
de: {res}Niedrig|Hoch|Höher|Konsole

source: {lang}English|French|Spanish|Danish
de: {lang}Englisch|Französisch|Spanisch|Dänisch

source: {dir}Filename|Size|Time
de: {dir}Dateiname|Größe|Zeit

source: {tools}&Go|&Back
de: {tools}&Gehe|&Zurück

source: {tabs}&Run|T&ools|Pick|Output|Drive %c|Info|Keyboard|More
de: {tabs}Start|Werkzeuge|Auswahl|Output|Laufwerk %c|Info|Tastatur|Mehr

source: {tabs}Screenshot|Loading screen|Map
de: {tabs}Screenshot|Ladebildschirm|Karte

source: {info}Display name|Internal name|Version|Company|autorun|sna|Drive %c|Fullscreen|Textmode|Model|Keyboard|Video|Profile
de: {info}Angezeigter Name|Interner Name|Version|Firma|Autorun|Sna|Laufwerk %c|Vollbildschirm|Textmodus|Modell|Tastatur|Video|Profil

source: {tools}Extract %s image|Create %s image|Convert NVG games|Convert NVG maps|Merge TACGR|Explore
de: {tools}Extrahiere %s image|Erstelle %s image|Konvertiere NVG Spiele|Konvertiere NVG Karten|Verbinde TACGR|Suche

source: Text|Background 1|Background 2
de: Text|Hintergrund 1|Hintergrund 2

source: Default|System colors|B/W|White|Custom
de: Standard|Systemfarben|S/W|Weiss|Eigene

source: Default|System|Small|Custom
de: Standard|System|Klein|Eigene

source: {caption}Categories|Games|%s - Images|%s - Screenshot|%s - Info
de: {caption}Kategorien|Spiele|%s - Bilder|%s - Screenshot|%s - Info

source: {caption}Toolbar
de: {caption}Werkzeugleiste

source: {caption}Internal
de: {caption}(Intern)

source: The file %s already exists. Overwrite ?
de: Datei %s existiert bereits. Überschreiben ?

source: {filter}Zip Archives
de: {filter}Zip Archive

source: {filter}XML Files
de: {filter}XML Dateien

source: {filter}Database Files
de: {filter}Datenbank Dateien

source: {about}Translation
de: {about}Übersetzung

source: {about}Translator
de: {about}Übersetzer

source: {about}Instance
de: {about}Instanz

source: {about}Installed
de: {about}Installiert

source: {about}File size
de: {about}Dateigröße

source: {about}Session time
de: {about}Sessionszeit

source: {error}Internal disk <%s> not found
de: {error}Interne Disk <%s> nicht gefunden

source: {error}%s requires %s
de: {error}%s benötigt %s

source: {error}Failed to run %s
de: {error}Start von %s fehlgeschlagen

source: {error}Failed to set drive to %s
de: {error}Fehler Laufwerk zu zu setzen%s

source: {error}File is read-only|File not found|Failed to update %s %s
de: {error}Datei ist schreibgeschützt|Datei nicht gefunden|Konnte nicht updaten %s %s

source: {error}Bad image
de: {error}Schlechtes image

source: {error}Syntax error detected on command line.
de: {error}Syntaktischer Fehler in Kommandozeile.

source: {error}Failed to open folder %s
de: {error}Konnte Ordner %s nicht öffnen

source: {error}Failed to open file %s
de: {error}Konnte Datei %s nicht öffnen

source: {error}Failed to create temp dir %s
de: {error}Konnte das tempöräre Verzeichnis %s nicht erstellen

source: {error}There was a problem with printing.
de: {error}Fehler beim Ausdrucken.

source: {error}There was a problem with previewing.
de: {error}Fehler bei der Vorschau.

source: {error}Failed to create file %s
de: {error}Konnte Datei %s nicht erstellen

source: {error}Not implemented yet
de: {error}Noch nicht implementiert

source: Failed to launch browser
de: Konnte Browser nicht starten

source: {error}%s not supported
de: {error}%s nicht unterstützt

source: {caprice}F1 Toggle Fullscreen F2 Load Snapshot F4 Save Snapshot F5 Reset F6 Load Drive A F7 Load Drive B F10 Exit PrtScr Screenshot Pause Pause
de: {caprice}F1 Umschalten Vollbildschirm F2 Lade Snapshot F4 Speichere Snapshot F5 Reset F6 Lade Laufwerk A F7 Lade Laufwerk B F10 Exit PrtScr Screenshot Pause Pause

source: {cmdline}Show this help message
de: {cmdline}Zeige diese Hilfe an

source: {cmdline}Tools page
de: {cmdline}Werkzeug Seite

source: {cmdline}Settings page
de: {cmdline}Einstellungsseite

source: {cmdline}Maximize
de: {cmdline}Maximiere

source: {cmdline}Debug
de: {cmdline}Fehlersuche

source: {cmdline}Language
de: {cmdline}Sprache

source: {cmdline}Translate word
de: {cmdline}Übersetze Wort

source: {cmdline}Input file
de: {cmdline}Input Datei
