<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
 <title>DCEXEL - Notice</title>
 <style type="text/css">
  body {font-family: verdana, arial, helvetica, sans-serif; font-size: 80%; color: #000; background-color: #fff;}
  h1,h2,h3 {color: #000; margin-top: 1em; margin-bottom: 0.5em;}
  h2 {margin-top: 3em;}
  h1 {font-size: 180%; background-color: #4cf; padding-left: 0.2em;}
  h2 {font-size: 140%; background-color: #cff; padding-left: 0.2em;}
  h3 {font-size: 100%; border-style: none; border-bottom: solid 1px #ccc; margin-left: 0.8em;}
  p  {margin-left: 1em; margin-top: 0em;}
  ul {margin-left: 2em; margin-top: 0em;}
 </style>
 <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
 <meta name="description" content="DCEXEL - Notice">
 <meta name="author" content="Daniel Coulom">
 <meta name="keywords" content="dcexel, emulateur, exelvision">
</head>

<body>
<h1>DCEXEL - Notice</h1>
<p>
DCEXEL est un &eacute;mulateur pour Windows des ordinateurs 8 bits Exelvision.<br>
Version : 2012.04<br>
Auteur : Daniel Coulom<br>
Site web : <a href="http://dcexel.free.fr">dcexel.free.fr</a>
</p>

<h3>Ordinateurs et p&eacute;riph&eacute;riques &eacute;mul&eacute;s</h3>  
<p>
La version actuelle &eacute;mule l'EXL100, l'Exeltel, l'Exeltel VS, l'Exeltel VX Amper, le Comtel, l'Exelm&eacute;moire<br>
16K et 64K, le lecteur-enregistreur de cassette, l'Exeldisk, l'Exelmouse, l'imprimante s&eacute;rie, la bo&icirc;te<br>
de rythmes ExelDrums, y compris les sons non document&eacute;s par Exelvision.<br>
</p>

<h3>Avertissement</h3>  
<p>
DCexel est un logiciel en d&eacute;veloppement constant, et peut contenir un grand nombre d'anomalies.<br>
Si vous constatez un fonctionnement diff&eacute;rent de celui du mat&eacute;riel r&eacute;el, il faut le signaler &agrave;<br>
l'auteur, pour lui permettre d'inclure la correction dans la version suivante.
</p>


<h2>Licence</h2>
<p>
DCEXEL est distribu&eacute; gratuitement dans l'espoir qu'il sera utile, mais SANS AUCUNE GARANTIE.<br>
Pas m&ecirc;me la garantie qu'il peut fonctionner avec votre ordinateur ou r&eacute;pondre &agrave; vos objectifs.
</p>
<ul>
<li>Il peut &ecirc;tre utilis&eacute; librement dans un cadre priv&eacute;, mais il ne doit en aucune fa&ccedil;on servir<br>
&agrave; des fins commerciales, ou publicitaires, ou de promotion de site internet.</li>
<li>Tous les fichiers et copies d'&eacute;crans produits par DCExel sont exclusivement &agrave; usage priv&eacute;.<br>
Il n'est pas permis de les diffuser publiquement, sauf d&eacute;rogation &eacute;crite accord&eacute;e par l'auteur.</li>
<li>Les sources sont encore en constante &eacute;volution, c'est pourquoi elles ne sont pas fournies.<br>
Le d&eacute;sassemblage ou "reverse engineering" est autoris&eacute;, mais il est beaucoup plus simple<br>
d'interroger l'auteur sur les m&eacute;thodes et algorithmes employ&eacute;s.</li>
<li>La rediffusion de DCEXEL est autoris&eacute;e uniquement par un lien vers la page d'accueil du<br>
site officiel, pour &eacute;viter la prolif&eacute;ration de versions obsol&egrave;tes, incompl&egrave;tes ou modifi&eacute;es.</li>
</ul>


<h2>Installation</h2>

<h3>Configuration requise</h3>
<p>
Processeur Pentium ou compatible Pentium, fr&eacute;quence 300 MHz ou plus.<br>
Windows 98/ME ou Windows 2000/XP/Vista/Seven et suivants.<br>
Carte graphique avec r&eacute;solution minimum 640x480, 65536 couleurs ou plus.<br>
Carte son obligatoire.
</p>

<h3>Proc&eacute;dure</h3>
<p>
D&eacute;compressez le fichier .zip dans un r&eacute;pertoire.<br>
Cr&eacute;ez un raccourci vers le programme (facultatif).<br>
</p>

<h3>Utilisation</h3>
<p>
Lancez le programme dcexel.exe par un double-clic ou utilisez le raccourci.<br>
Choisissez votre langue (Menu Paramètres).<br>
Consultez l'aide en ligne du programme et la documentation du site dcexel.<br>
La configuration du clavier peut &ecirc;tre affich&eacute;e (Aide/Clavier EXL100).<br>
Les logiciels utilisables avec l'&eacute;mulateur sont disponibles sur le site dcexel sous forme d'images de<br>
cartouches, de cassettes et de disquettes.
</p>

<h3>Version d&eacute;veloppeur</h3>
<p>
Il existe une version sp&eacute;ciale de DCEXEL pour les d&eacute;veloppeurs d'applications sur les plateformes Exelvision.<br>
Elle comporte un outil de mise au point des programmes. Si vous avez fait vos preuves en publiant des<br>
d&eacute;monstrations, des jeux ou des utilitaires, vous pouvez obtenir cette version en envoyant une lettre de<br>
motivation &agrave; l'auteur.
</p>

<h3>Faux positif avec les programmes anti-virus</h3>
<p>
Les ROMs Exelvision contiennent des s&eacute;quences d'octets qui ressemblent parfois &agrave; des signatures de virus.<br>
De plus l'ex&eacute;cutable dcexel.exe est compact&eacute; avec UPX, et lance six processus dcexeldrums.tmp pour<br>
&eacute;muler les six canaux des Exeldrums. Ce comportement para&icirc;t suspect (&agrave; tort) &agrave; plusieurs programmes<br>
 anti-virus, qui peuvent &eacute;ventuellement emp&ecirc;cher l'&eacute;mulateur de fonctionner normalement. Si c'est le cas, il<br>
faut param&eacute;trer l'anti-virus pour ne pas scanner dcexel et lui permettre de lancer les processus dcexeldrums.
</p>

 
<h2>Historique</h2>

<h3>Version 2012.04</h3>
<ul>
<li>Ajustement des temporisations des entr&eacute;es/sorties pour minimiser les blocages de programmes.</li>
<li>Ajout d'un nouvel outil graphique pour &eacute;muler le clavier de l'EXL100 en utilisant la souris du PC.</li>
<li>Rafra&icirc;chissement de l'&eacute;cran quand le registre BAPA du processeur vid&eacute;o est modifi&eacute;.</li>
<li>Ajustement de la couleur magenta pour un rendu plus r&eacute;aliste de la palette Exelvision.</li>
<li>Légère modification de l'organisation de la barre de menu.</li>
<li>Diverses corrections et am&eacute;liorations mineures.</li>
</ul>

<h3>Version 2011.10</h3>
<ul>
<li>Correction d'une anomalie d'affichage des caract&egrave;res clignotants.</li>
<li>Ajout d'un signal sonore pendant le fonctionnement de l'imprimante s&eacute;rie ou de l'imprimante parall&egrave;le.</li> 
<li>Ajout de l'&eacute;mulation de l'imprimante parall&egrave;le.</li> 
<li>Fermeture automatique du fichier d'impression pour permettre sa consultation sans quitter dcexel.</li> 
<li>Nombreuses am&eacute;liorations techniques sans incidence visible sur le fonctionnement de l'&eacute;mulateur.</li> 
</ul>

<h3>Version 2010.12</h3>
<ul>
<li>Possibilit&eacute; de s&eacute;lectionner la ROM du lecteur de disquette parmi les quatre versions connues</li> 
<li>R&eacute;glage deux fois plus fin du volume du son pour la sortie cassette et le synth&eacute;tiseur vocal</li> 
<li>Refonte totale de l'&eacute;mulation Exeldrums avec les &eacute;chantillons r&eacute;els de tous les instruments</li> 
<li>Quelques am&eacute;liorations techniques de l'&eacute;mulateur sans impact majeur sur son utilisation</li> 
</ul>

<h3>Version 2010.06</h3>
<ul>
<li>Version d&eacute;veloppeur : nouvelle fonction de chargement d'un fichier binaire en m&eacute;moire video</li> 
<li>Version d&eacute;veloppeur : nouvelle fonction de chargement d'un fichier binaire en rom ou en ram</li> 
<li>Ajustement de plusieurs tables de param&egrave;tres de la synth&egrave;se vocale</li>
<li>Am&eacute;lioration de l'&eacute;mulation TMS5220 pour un meilleur rendu des sons 'unvoiced' et mixtes</li>
</ul>

<h3>Version 2010.05</h3>
<ul>
<li>Ajout d'un filtre passe-bas &agrave; la sortie cassette pour retrouver la sonorit&eacute; de la vraie machine</li>
<li>Correction d'une erreur d'arrondi provoquant des oscillations parasites du son de la sortie cassette</li> 
<li>Correction d'une anomalie d'allocation dynamique de m&eacute;moire pour la cassette</li>
<li>Message d'avertissement (optionnel) en cas de lecture apr&egrave;s la fin de la cassette</li>
</ul>

<h3>Version 2010.03</h3>
<ul>
<li>Nouvelle fonction pour simuler le clavier avec le contenu du presse-papier</li>
<li>Suppression de la limite de taille des cassettes</li> 
<li>Am&eacute;lioration du son de la sortie cassette, par int&eacute;gration du signal sur la p&eacute;riode d'&eacute;chantillonnage</li>
<li>Version d&eacute;veloppeur : affichage des param&egrave;tres du timer 3 du TMS7042</li> 
<li>Version d&eacute;veloppeur : m&eacute;morisation des adresses des dumps m&eacute;moire et VRAM</li> 
<li>Version d&eacute;veloppeur : bo&icirc;tes de dialogue distinctes pour le CPU et pour le VDP</li> 
<li>Plusieurs am&eacute;liorations mineures de l'&eacute;mulation du tms7000</li> 
<li>Plusieurs am&eacute;liorations mineures de l'&eacute;mulation du tms3556</li> 
<li>Programmation de la fonction 6 du tms7042 : initialisation du port s&eacute;rie et du timer 3</li> 
</ul>


<h3>Version 2010.02</h3>
<ul>
<li>Int&eacute;gration de la rom 6100 et du g&eacute;n&eacute;rateur sp&eacute;cifiques de l'Amper</li> 
<li>Outil de mise au point : ajout de libell&eacute;s &agrave; l'affichage des pages m&eacute;moire</li>
<li>Outil de mise au point : la position des ascenseurs d'affichage des registres reste fixe pendant l'exécution</li>
<li>Outil de mise au point : point d'arr&ecirc;t non modifi&eacute; par l'ex&eacute;cution et sauv&eacute; dans le fichier .ini</li>
<li>Outil de mise au point : adresse de début du dump vram param&eacute;trable et contenu de la vram modifiable</li>
<li>Correction d'une anomalie dans la fonction de rechargement de tous les fichiers images</li>
<li>Emulation imparfaite et provisoire de la bo&icirc;te de rythmes ExelDrums</li>
<li>Ajout d'un param&egrave;tre pour supprimer l'acc&eacute;l&eacute;ration mat&eacute;rielle de l'affichage</li>
<li>Am&eacute;lioration du mode plein &eacute;cran pour permettre l'affichage du Gestionnaire des t&acirc;ches</li>
<li>Remplacement de Alt-Entree par PageUp et PageDown pour changer de mode &eacute;cran</li>
<li>La touche d'&eacute;mulation du bouton de Reset est s&eacute;lectionnable dans les options</li>
<li>La recharge des cartouches ne r&eacute;initialise plus le syst&egrave;me</li>
<li>Simplification du traitement de fin de cassette (suppression du message)</li>
<li>Am&eacute;lioration de la vitesse d'ex&eacute;cution de l'outil de mise au point</li>
<li>Ajout d'une option pour la sauvegarde automatique des fichiers images</li>
<li>Programmation de la fonction 7 du tms7042 (envoi du contenu de la rom 6100)</li>
</ul>

<h3>Version 2010.01</h3>
<ul>
<li>Fichiers image (cassette, disquettes, exelm&eacute;moire, cartouches) stock&eacute;s en m&eacute;moire</li>
<li>Nouvelle fonction, avec raccourci clavier, pour recharger tous les fichiers images</li>
<li>Nouvelle fonction, avec raccourci clavier, pour sauver tous les fichiers images modifi&eacute;s</li>
<li>R&eacute;glages de volume distincts pour le synth&eacute;tiseur et le son cassette</li>
<li>Emulation du changement de fr&eacute;quence du synth&eacute;tiseur de parole TMS5220</li>
<li>Emulation du jingle &agrave; l'initialisation du processeur d'entr&eacute;es/sorties</li>
<li>Emulation des sons de la rom 6100 (pour les machines concern&eacute;es)</li>
<li>Suppression de l'outil de mise au point des programmes dans la version standard</li>
<li>Nombreuses am&eacute;liorations de d&eacute;tails et corrections d'anomalies</li>
</ul>

<h3>Version 2009.12</h3>
<i>(Version interm&eacute;diaire &agrave; diffusion restreinte)</i>
<ul>
<li>Taille des copies d'&eacute;cran param&eacute;trable pour les adapter au mode 80 colonnes</li>
<li>Emulation de l'exelm&eacute;moire 64K</li>
<li>Emulation du mode 80 colonnes</li>
<li>Distinction de la cartouche de l'ordinateur et de la cartouche du lecteur de disquette</li>
<li>Ajout de l'&eacute;mulation Exeltel, Exeltel VS, Amper, Comtel</li>
<li>Correction de plusieurs instructions du microprocesseur. Exeltexte fonctionne</li>
</ul>

<h3>Version 2009.08</h3>
<ul>
<li>Ajout de l'&eacute;mulation de l'exelmouse, utilisable en particulier dans exelpaint</li>
<li>Correction de la vitesse du timer du TMS7041 : Descente et Slalom fonctionnent</li>
<li>Correction d'une anomalie dans le debugger (destruction d'une zone m&eacute;moire)</li>
</ul>

<h3>Version 2009.03</h3>
<ul>
<li>Petite modification du code envoy&eacute; en cas d'appui simultan&eacute; sur plusieurs touches</li>
<li>Ajout d'un param&egrave;tre pour forcer la taille de la RAM VDP de l'EXL100 &agrave; 64 Ko</li>
<li>Suppression de la ligne de statut en mode "mapping"</li>
<li>Programmation des modes grille et soulignement du TMS3556</li>
<li>Pas de mise &agrave; jour en temps r&eacute;el du fichier .cram pour un temps d'acc&egrave;s exact &agrave l'exelm&eacute;moire</li>
<li>Nouvelle option pour simuler un moniteur monochrome</li>
<li>Dans les param&egrave;tres, nouveaux boutons pour s&eacute;lectionner les vitesses mini et maxi du processeur</li>
<li>Mise &agrave; jour des signaux de synchronisation ligne et trame dans le registre STATUS du TMS3556</li>
<li>Correction d'une anomalie d'incr&eacute;mentation des pointeurs du TMS3556. VegaX4 fonctionne</li>
</ul>

<h3>Version 2009.02 SP1</h3>
<ul>
<li>Contr&ocirc;le suppl&eacute;mentaire du nombre de cycles pour &eacute;viter une situation de blocage</li>
<li>Correction de la fr&eacute;quence par d&eacute;faut du processeur : 2455 kHz. Le timer reste &agrave; 4910 kHz</li>
</ul>

<h3>Version 2009.02</h3>
<ul>
<li>Emulation du son en sortie de l'interface cassette</li>
<li>Correction d'une vingtaine d'erreurs dans la table de d&eacute;codage du clavier</li>
<li>Nouvelles options de compilation pour cr&eacute;er une version Windows d'un programme Exelvision</li>
<li>Modification de la structure des fichiers .mrx pour sauvegarder aussi la cram et la ram disk</li>
<li>Nouvelle fonction de mise au point : dump m&eacute;moire CPU ou VDP dans un fichier binaire</li>
<li>R&eacute;glage du volume du son dans la bo&icirc;te de dialogue des param&egrave;tres</li>
<li>Affichage des param&egrave;tres divers dans la bo&icirc;te de dialogue de mise au point</li> 
<li>Ajout d'un param&egrave;tre pour permettre l'&eacute;criture en ROM</li> 
<li>Emulation partielle du MC14497 et refonte compl&egrave;te de la gestion du clavier</li>
<li>Programmation du protocole de communication entre le TMS7041 et le TMS5220</li>
<li>Emulation du synth&egrave;tiseur vocal TMS5220</li>
<li>Refonte compl&egrave;te des communications entre le TMS7020 et le TMS7041</li>
<li>Correction d'un blocage dans le champ d'ast&eacute;ro&iuml;des de Wizord</li>
</ul>

<h3>Version 2009.01</h3>
<ul>
<li>Correction du bug de couleur des caract&egrave;res alphanum&eacute;riques dans 10.000 (jeu de d&eacute;s)</li>
<li>Correction du bug de clignotement du curseur exelbasic</li>
<li>Correction des anomalies de couleur en mode videotex</li>
<li>Correction de l'erreur 'instruction invalide' dans car-crash</li>
<li>Correction des anomalies de gestion des pointeurs ram vdp (Algos, Kung-Fu)</li>
<li>Traitement correct du clavier lorsque plusieurs touches sont enfonc&eacute;es simultan&eacute;ment</li>
<li>Extinction automatique de l'&eacute;cran apr&egrave;s 8 minutes d'inactivit&eacute;</li>
<li>Emulation des lecteurs de disquettes A: et B:</li>
<li>Envoi d'un code retour dans R32 en fin de fichier cassette</li> 
<li>Nouvelle bo&icirc;te de dialogue P&eacute;riph&eacute;riques (cartouche, exelm&eacute;moire, exeldisks, cassette)</li> 
<li>Ajout de la r&eacute;p&eacute;tition automatique des touches</li>
<li>Refonte de la barre de statut, avec informations sur les deux unit&eacute;s de disquettes</li>
<li>La bo&icirc;te de dialogue de mise au point permet de modifier les registres du tms3556</li>
<li>Ajout de la ram exeldisk dans les fichier de sauvegarde de l'&eacute;tat de la machine</li>
<li>Aide clavier EXL100 : image du clavier et correspondance des touches</li>
<li>Correction d'une dizaine d'erreurs dans la table de d&eacute;codage du clavier</li>
<li>La bo&icirc;te de dialogue P&eacute;ripheriques peut rester ouverte pendant l'&eacute;mulation</li>
<li>Mise à jour dynamique de l'index cassette dans la bo&icirc;te de dialogue P&eacute;riph&eacute;riques</li>
</ul>


<h3>Version 2008.10 (v0.4)</h3>
<ul>
<li>Programmation de l'&eacute;mulation exelm&eacute;moire</li>
<li>Programmation du chargement et d&eacute;chargement des fichiers .cram (image exelm&eacute;moire)</li>
<li>Correction d'une anomalie dans l'&eacute;mulation de l'interruption 1 (interruption TMS7041)</li>
<li>Affichage de la couleur de fond quand la ligne de status est masqu&eacute;e (ex: mille bornes)</li>
<li>Contournement du bug de l'initiation &agrave; l'exelbasic vol 1</li>
<li>Suppression du 'return' &agrave; r&eacute;p&eacute;tition apr&egrave;s lecture cassette (R3=R4=4 apres KEY_UP)</li>
<li>Correction de la couleur de fond des caract&egrave;res clignotants</li>
<li>Essai de synth&egrave;se du son des touches dans exelbasic et exelbasic+</li>
</ul>

<h3>Version 2008.09 (v0.3)</h3>
<ul>
<li>D&eacute;but du projet, mise en place de la structure du programme</li>
<li>Mise en forme des roms disponibles sur internet (merci &agrave; Walter) </li>
<li>Programmation du d&eacute;sassembleur et de l'&eacute;mulateur TMS7020</li>
<li>Mise en place de la structure de l'&eacute;mulateur TMS3556</li>
<li>Mise au point du d&eacute;bugger</li>
<li>Extraction du logo exelvision de la rom TMS7041</li>
<li>Programmation du mode graphique. Le logo est affich&eacute; correctement</li>
<li>Programmation des modes texte. D&eacute;but d'affichage du d&eacute;cor de Guppy</li>
<li>Programmation du clignotement et des attributs video. Ecrans Basic OK</li>
<li>Correction du mode double hauteur</li>
<li>R&eacute;daction de l'aide Anglais/Francais</li>
<li>Programmation du timer et des interruptions (animation dans Guppy)</li>
<li>Correction de quelques bugs + scrutation clavier</li>
<li>Programmation du protocole de communication tms7020 &lt;--&gt; tms7041</li>
<li>Am&eacute;lioration de l'&eacute;mulation TMS7020 : ajout carry, instruction microcod&eacute;e d728 (lecture vdp), correction instruction CMP</li>
<li>Emulation du clavier termin&eacute;e, toutes les touches sont d&eacute;finies dans la table de conversion </li>
<li>Correction de la couleur de clignotement du curseur</li>
<li>Refonte de l'&eacute;mulation TMS3556. La plupart des anomalies d'affichage ont disparu</li>
<li>Ajout des codes des touches avec CTRL. Le break par CTRL-C fonctionne en Basic</li>
<li>Correction d'un bug de la multiplication (les op&eacute;randes ne sont pas sign&eacute;s)</li>
<li>Simulation de la frappe au clavier avec les donn&eacute;es du fichier keyboard.txt </li>
<li>Correction d'un bug dans la gestion du timer (plus de plantage dans Quizzy)</li>
<li>Correction d'un bug d'affichage (M'Yams, Nimbus, Car Crash etc. fonctionnent)</li>
<li>Am&eacute;lioration de la gestion du flag "speech en cours" (bit 1 du registre R2)</li>
<li>Correction des r&egrave;gles d'affichage en double hauteur. Quizzy fonctionne bien</li>
<li>Traitement de la lecture des ports p&eacute;ripheriques par les instructions BTJO et BTJZ</li>
<li>Bo&icirc;te de dialogue pour le choix du fichier texte de simulation d'entr&eacute;e au clavier</li>
<li>Correction des codes touche avec 'Fonction'. FONCT-D donne l'invincibilit&eacute; dans Wizord</li>
<li>Programmation lecture et &eacute;criture des fichiers .k7. Test avec Monopolic</li>
<li>Test pour ne pas &eacute;craser les octets 0000-01ff en chargeant les cartouches de 32 Ko</li>
<li>Programmation de l'instruction microcod&eacute;e d700 (lecture vdp). Exelmax fonctionne</li>
<li>Programmation de l'outil magn&eacute;tophone</li>
<li>Programmation de la sortie imprimante dans un fichier dcexel-printer.txt</li>
<li>Programmation de la sauvegarde et de la restauration de l'&eacute;tat de l'ordinateur</li>
</ul>

<hr><center>&copy; 2010 - Daniel Coulom</center>

</body>
</html>
